use FoodDeliveryDB;

Insert into Clients(Name,AddressClient,PhoneNumber)
Values ('Иван','ул.Петър Бонев','0892550084'),
       ('Кирил','ул.Иван Асен','0894561124'),
	   ('Петър','бул.Съединение','0887845623'),
	   ('Мария','бул.Свобода','0884551998'),
	   ('Ивана','ул.Иван Вазов','0899774015');
	   
Insert into Food(FoodName_ID,TypeOfFood,Price)
Values ('Салата капрезе','Салата',10.99), 
       ('Пилешки супа','Супа',8.99),
	   ('Ребърца','Основно ястие',14.99),
	   ('Шоколодаво суфле','Десерт',5.99),
	   ('Картофи','Гарнитура',4.99);
	   
Insert into OrderDate(Client_ID,DateOrder,DateDelivery,Quantity,FoodName_ID)
Values (1,'2021-12-25 14:58:26','2021-12-25 15:38:58',2,'Салата капрезе'),
       (2,'2021-12-27 12:21:35','2021-12-27 12:52:09',3,'Ребърца'),
	   (3,'2022-01-03 17:42:19','2022-01-03 18:05:22',3,'Ребърца'),
	   (4,'2022-01-04 11:48:26','2022-01-04 11:26:38',1,'Салата капрезе'),
	   (5,'2022-01-05 16:40:46','2022-01-05 17:09:51',2,'Картофи');
	   
Insert into Providers(Status,TimeDelivery,Client_ID,Mark,MethodOfPayment,Order_ID)
Values ('Приготвя се','00:32:15',1,8.7,'С карта',1),
       ('Пътува към клиента','00:42:37',2,9.7,'В брой',2),
	   ('Приемане на поръчка','00:27:50',3,6.9,'С карта',3),
	   ('Приготвя се','00:23:55',4,7.3,'В брой',4),
	   ('Пътува към клиента','00:29:30',5,8.2,'С карта',5);
	  
Insert into Workers(WorkerName,WorkerShift,Provider_ID)
Values ('Илиян','Нощна',1),
       ('Емилия','Дневна',2),
	   ('Николай','Дневна',3),
	   ('Георги','Нощна',4),
	   ('Борис','Нощна',5);
	   